# 4. Пользователь вводит целое положительное число...определяется максимальное числе в сете

print('------------------------------------------------------')
number_inp = int(input('Введите целое положительное число:  '))
print('------------------------------------------------------')

while number_inp > 0:
    last = number_inp % 10
    number_inp = int(number_inp) // 10
    if number_inp != 0 and last > number_inp % 10:
        number_inp = str(number_inp // 10) + str(last)
        number_inp = int(number_inp)

print('Максимальное число внутри вашего набора чисел - ', last)
print('------------------------------------------------------')
